# Apply Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FormulaEditingEventArgs..::..Apply Method
FormulaEditingEventArgs Class See Also
---
Applies formula to the parameter
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void Apply(
	string formula
)
```

Visual Basic
---
```text
Public Sub Apply ( _
	formula As String _
)
```

Visual C++
---
```text
public:
void Apply(
	String^ formula
)
```

# ### Parameters
formula
    Type: System..::..String
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FormulaEditingEventArgs Class
Autodesk.Revit.UI.Events Namespace